# これからのカリキュラムで、主に学ぶのはRuby,Ruby on Railsを
# 使ったアプリケーション開発のスキルです。

# 他のプログラミング言語やフレームワークと比較して、
# RubyやRailsにはどのような特徴があるか、箇条書きで述べてください。


# 回答
# ＜Rubyの特徴＞
# ・スクリプト言語である。
#   プログラミング言語には、「コンパイラ言語」「スクリプト言語」と言われる言語がある。
#   人間が書いたコードを、機械が実行するには「翻訳」を行う必要があり、コンパイラ言語は事前に全て翻訳する。スクリプト言語は随時翻訳しつつ実行する。
#   この違いにより、スクリプト言語であるRubyはコンパイルが必要ないため開発しやすい反面、実行速度は遅めである。
# ・オブジェクト指向言語である
#   Rubyはスクリプト言語だがオブジェクト指向の言語。そのため変更に強かったり、再利用しやすいコードを書きやすい。

# ・生産性が高い
#   上記の理由から、Rubyはコードの記述量が少なくすんだりコンパイルの時間がかからないなど生産性が高い。
#   そのため、フレームワークであるRailsと合わせて、短期間でプロダクト開発を進める必要があるスタートアップ企業で好まれる。

# ＜Railsの特徴＞
# ・言語としてRubyを使用しているため、比較的習得しやすい。
# ・習得したスキルを広く活用できる
#   言語によっては、使われているフレームワークが多数ある。例えばPHPを学んでも、それとは別に様々なフレームワークについても学ぶ必要がある。
#   RubyについてはRailsがほぼ１択であるため、一度習得してしまえば幅広く活用できる。
# ・開発を効率化する仕組みが多数用意されているため生産性が高い
#   Railsにはrails newをするだけでアプリの雛形を作成できたりActiveRecordによってSQL操作ができるなど、開発効率を高めてくれる仕組みが標準で組み込まれている。