# 問題１
# linuxではディレクトリやファイルを階層構造で管理します。
# 「ルートディレクトリ」「ホームディレクトリ」とは何ですか。それぞれ一言で説明してください。

# ・ルートディレクトリ
#   階層構造の一番根元にあるディレクトリ。/。
# ・ホームディレクトリ
#   ターミナル起動時に最初に作業中になるディレクトリ。~。
#   各ユーザーに割り当てられたディレクトリ。


# 問題２
# 「ルートディレクトリ」「ホームディレクトリ」それぞれに移動するため、ターミナルで打つべきコマンドを答えてください。

# ・ルートディレクトリ
#   cd /
# ・ホームディレクトリ
#   cd または cd ~


# 問題３
# ターミナルでは、フォルダやファイル名の補完機能が使えます。
# これは具体的にどのような機能なのか説明してください。

# フォルダやファイル名の入力中にtabキーを押すことで、候補となるフォルダやファイル名を自動で入力してくれる機能。
# また、候補が複数ある場合、tabキーを2回押すことで候補を一覧表示することができる。


# 問題４
# 現在のカレントディレクトリが~/Desktopだったとします。
# デスクトップに「text」というフォルダがある場合、そのフォルダ名を
# 相対パスおよび絶対パスで表してください。

# ・相対パス
#   text
# ・絶対パス
#   ~/Desktop/text