# HTML, CSSに関する以下の設問に答えてください。

# (1)HTMLタグは大きく「ブロック要素」「インライン要素」に分けられます。それぞれどのような特徴があり、具体的にどんなタグが含まれるか説明してください。
# ブロック要素：見出しや段落など、主にページ内のレイアウトを行うために使う要素
# インライン要素：主にブロック要素の中で使われる要素で、文章の一部を装飾するためなどに使う

# (2)classセレクタおよびidセレクタについてそれぞれの特徴を説明してください。
# class: 種別名を割り当てるもので、同じclass名を何度も使うことができる
# id: 固有の名前を割り当てるもので、同じid名は一度しか使わない

# (3)リセットcssの役割について説明してください。
# ブラウザがデフォルトで持つスタイルを無効化し、ブラウザごとに表示の差異がでないようにするcss

# (4)ブロック要素を横並びにさせるために、float以外にどのような方法があるか簡単に述べてください。
# display: flex;
# display: inline-block;
# display:inline;

# (5)webフォントとは何か、特徴と使用するメリットを簡潔に述べてください。
# webサーバー上で提供されるフォントで、どの端末からアクセスしても同じフォントを表示できる