# （１）Railsのマイグレーションファイルは、ファイルを作成後にマイグレートをして初めてDBに変更が加わります。
# 今存在している複数のマイグレーションファイルのうち、
# どのファイルまでマイグレートが終わっているか確認するためにターミナルでどのようなコマンドを打てばよいですか。
rails db:migrate:status


# （２）マイグレートを行なった後、その内容に誤りがあることがわかりました。
# どのように修正すればよいか、手順を述べてください。
rails db:rollback
修正
rails db:migrate

例２）
①rails g migrationで新たなマイグレーションファイルを作成する
②修正箇所を正しい内容に変更するためのマイグレーションファイルを作成する
③マイグレートを実行する


# （３）一度実行されたマイグレーションファイルは、次のマイグレートに影響は及ぼしません。
# そのため、マイグレート後にファイルを変更したり削除したとしても今のDBに悪影響を及ぼすことはありません。
# ただし、上記の行為は絶対に行なってはいけません。
# その理由はいくつかありますが、開発において致命的な不具合が出てしまう理由をお答えください。

アプリケーションのファイルをデプロイ先にpushし、マイグレートを行なった時に、
ローカル環境と違ったDBが出来上がったり、エラーになってしまうから。